cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1233D5PM.svd
        <register>
          <name>_9BITAMASK</name>
          <description>UART 9-Bit Self Address Mask</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>UART_9BITAMASK_MASK</name>
              <description>Self Address Mask for 9-Bit Mode</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>UART Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>UART_PP_SC</name>
              <description>Smart Card Support</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UART_PP_NB</name>
              <description>9-Bit Support</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>UART Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>UART_CC_CS</name>
              <description>UART Baud Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART_CC_CS_SYSCLK</name>
                  <description>The system clock (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UART_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART1</name>
      <prependToName>UART1</prependToName>
      <baseAddress>0x4000D000</baseAddress>
      <interrupt><name>UART1</name><value>6</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART2</name>
      <prependToName>UART2</prependToName>
      <baseAddress>0x4000E000</baseAddress>
      <interrupt><name>UART2</name><value>33</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART3</name>
      <prependToName>UART3</prependToName>
      <baseAddress>0x4000F000</baseAddress>
      <interrupt><name>UART3</name><value>59</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART4</name>
      <prependToName>UART4</prependToName>
      <baseAddress>0x40010000</baseAddress>
      <interrupt><name>UART4</name><value>60</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART5</name>
      <prependToName>UART5</prependToName>
      <baseAddress>0x40011000</baseAddress>
      <interrupt><name>UART5</name><value>61</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART6</name>
      <prependToName>UART6</prependToName>
      <baseAddress>0x40012000</baseAddress>
      <interrupt><name>UART6</name><value>62</value></interrupt>
    </peripheral>
    <peripheral derivedFrom="UART0">
      <name>UART7</name>
      <prependToName>UART7</prependToName>
      <baseAddress>0x40013000</baseAddress>
      <interrupt><name>UART7</name><value>63</value></interrupt>
    </peripheral>
    <peripheral>
      <name>I2C0</name>
      <description>Register map for I2C0 peripheral</description>
      <groupName>I2C</groupName>
      <prependToName>I2C0</prependToName>
      <baseAddress>0x40020000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt><name>I2C0</name><value>8</value></interrupt>
      <registers>
        <register>
          <name>MSA</name>
          <description>I2C Master Slave Address</description>
          <addressOffset>0x00000000</addressOffset>
          <fields>
            <field>
              <name>I2C_MSA_RS</name>
              <description>Receive not send</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MSA_SA</name>
              <description>I2C Slave Address</description>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <description>I2C Master Control/Status</description>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2C_MCS_RUN</name>
              <description>I2C Master Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_START</name>
              <description>Generate START</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ADRACK</name>
              <description>Acknowledge Address</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ACK</name>
              <description>Data Acknowledge Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ARBLST</name>
              <description>Arbitration Lost</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_IDLE</name>
              <description>I2C Idle</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_CLKTO</name>
              <description>Clock Timeout Error</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCS</name>
          <description>I2C Master Control/Status</description>
          <alternateGroup>I2C0_ALT</alternateGroup>
          <addressOffset>0x00000004</addressOffset>
          <fields>
            <field>
              <name>I2C_MCS_BUSY</name>
              <description>I2C Busy</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_ERROR</name>
              <description>Error</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_STOP</name>
              <description>Generate STOP</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_DATACK</name>
              <description>Acknowledge Data</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_HS</name>
              <description>High-Speed Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCS_BUSBSY</name>
              <description>Bus Busy</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MDR</name>
          <description>I2C Master Data</description>
          <addressOffset>0x00000008</addressOffset>
          <fields>
            <field>
              <name>I2C_MDR_DATA</name>
              <description>Data Transferred</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MTPR</name>
          <description>I2C Master Timer Period</description>
          <addressOffset>0x0000000C</addressOffset>
          <fields>
            <field>
              <name>I2C_MTPR_TPR</name>
              <description>Timer Period</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>I2C_MTPR_HS</name>
              <description>High-Speed Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MIMR</name>
          <description>I2C Master Interrupt Mask</description>
          <addressOffset>0x00000010</addressOffset>
          <fields>
            <field>
              <name>I2C_MIMR_IM</name>
              <description>Master Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MIMR_CLKIM</name>
              <description>Clock Timeout Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MRIS</name>
          <description>I2C Master Raw Interrupt Status</description>
          <addressOffset>0x00000014</addressOffset>
          <fields>
            <field>
              <name>I2C_MRIS_RIS</name>
              <description>Master Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MRIS_CLKRIS</name>
              <description>Clock Timeout Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MMIS</name>
          <description>I2C Master Masked Interrupt Status</description>
          <addressOffset>0x00000018</addressOffset>
          <fields>
            <field>
              <name>I2C_MMIS_MIS</name>
              <description>Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MMIS_CLKMIS</name>
              <description>Clock Timeout Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MICR</name>
          <description>I2C Master Interrupt Clear</description>
          <addressOffset>0x0000001C</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2C_MICR_IC</name>
              <description>Master Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_MICR_CLKIC</name>
              <description>Clock Timeout Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR</name>
          <description>I2C Master Configuration</description>
          <addressOffset>0x00000020</addressOffset>
          <fields>
            <field>
              <name>I2C_MCR_LPBK</name>
              <description>I2C Loopback</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_MFE</name>
              <description>I2C Master Function Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_SFE</name>
              <description>I2C Slave Function Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>I2C_MCR_GFE</name>
              <description>I2C Glitch Filter Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCLKOCNT</name>
          <description>I2C Master Clock Low Timeout Count</description>
          <addressOffset>0x00000024</addressOffset>
          <fields>
            <field>
              <name>I2C_MCLKOCNT_CNTL</name>
              <description>I2C Master Count</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MBMON</name>
          <description>I2C Master Bus Monitor</description>
          <addressOffset>0x0000002C</addressOffset>
          <fields>
            <field>
              <name>I2C_MBMON_SCL</name>
              <description>I2C SCL Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_MBMON_SDA</name>
              <description>I2C SDA Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MCR2</name>
          <description>I2C Master Configuration 2</description>
          <addressOffset>0x00000038</addressOffset>
          <fields>
            <field>
              <name>I2C_MCR2_GFPW</name>
              <description>I2C Glitch Filter Pulse Width</description>
              <bitRange>[6:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_BYPASS</name>
                  <description>Bypass</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_1</name>
                  <description>1 clock</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_2</name>
                  <description>2 clocks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_3</name>
                  <description>3 clocks</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_4</name>
                  <description>4 clocks</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_8</name>
                  <description>8 clocks</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_16</name>
                  <description>16 clocks</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2C_MCR2_GFPW_32</name>
                  <description>32 clocks</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR</name>
          <description>I2C Slave Own Address</description>
          <addressOffset>0x00000800</addressOffset>
          <fields>
            <field>
              <name>I2C_SOAR_OAR</name>
              <description>I2C Slave Own Address</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>I2C Slave Control/Status</description>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2C_SCSR_RREQ</name>
              <description>Receive Request</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_FBR</name>
              <description>First Byte Received</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_OAR2SEL</name>
              <description>OAR2 Address Matched</description>
              <bitRange>[3:3]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SCSR</name>
          <description>I2C Slave Control/Status</description>
          <alternateGroup>I2C0_ALT</alternateGroup>
          <addressOffset>0x00000804</addressOffset>
          <fields>
            <field>
              <name>I2C_SCSR_DA</name>
              <description>Device Active</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SCSR_TREQ</name>
              <description>Transmit Request</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SDR</name>
          <description>I2C Slave Data</description>
          <addressOffset>0x00000808</addressOffset>
          <fields>
            <field>
              <name>I2C_SDR_DATA</name>
              <description>Data for Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SIMR</name>
          <description>I2C Slave Interrupt Mask</description>
          <addressOffset>0x0000080C</addressOffset>
          <fields>
            <field>
              <name>I2C_SIMR_DATAIM</name>
              <description>Data Interrupt Mask</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_STARTIM</name>
              <description>Start Condition Interrupt Mask</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SIMR_STOPIM</name>
              <description>Stop Condition Interrupt Mask</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SRIS</name>
          <description>I2C Slave Raw Interrupt Status</description>
          <addressOffset>0x00000810</addressOffset>
          <fields>
            <field>
              <name>I2C_SRIS_DATARIS</name>
              <description>Data Raw Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_STARTRIS</name>
              <description>Start Condition Raw Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SRIS_STOPRIS</name>
              <description>Stop Condition Raw Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMIS</name>
          <description>I2C Slave Masked Interrupt Status</description>
          <addressOffset>0x00000814</addressOffset>
          <fields>
            <field>
              <name>I2C_SMIS_DATAMIS</name>
              <description>Data Masked Interrupt Status</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_STARTMIS</name>
              <description>Start Condition Masked Interrupt Status</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>I2C_SMIS_STOPMIS</name>
              <description>Stop Condition Masked Interrupt Status</description>
              <bitRange>[2:2]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SICR</name>
          <description>I2C Slave Interrupt Clear</description>
          <addressOffset>0x00000818</addressOffset>
          <access>write-only</access>
          <fields>
            <field>
              <name>I2C_SICR_DATAIC</name>
              <description>Data Interrupt Clear</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_STARTIC</name>
              <description>Start Condition Interrupt Clear</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>I2C_SICR_STOPIC</name>
              <description>Stop Condition Interrupt Clear</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SOAR2</name>
          <description>I2C Slave Own Address 2</description>
          <addressOffset>0x0000081C</addressOffset>
          <fields>
            <field>
              <name>I2C_SOAR2_OAR2</name>
              <description>I2C Slave Own Address 2</description>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>I2C_SOAR2_OAR2EN</name>
              <description>I2C Slave Own Address 2 Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SACKCTL</name>
          <description>I2C Slave ACK Control</description>
          <addressOffset>0x00000820</addressOffset>
          <fields>
            <field>
              <name>I2C_SACKCTL_ACKOEN</name>
              <description>I2C Slave ACK Override Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>I2C_SACKCTL_ACKOVAL</name>
              <description>I2C Slave ACK Override Value</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>I2C Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>I2C_PP_HS</name>
              <description>High-Speed Capable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>I2C Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>I2C_PC_HS</name>
              <description>High-Speed Capable</description>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
