cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1233D5PM.svd
        <register>
          <name>CONTIM</name>
          <description>USB Connect Timing</description>
          <addressOffset>0x0000007A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_CONTIM_WTID</name>
              <description>Wait ID</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>USB_CONTIM_WTCON</name>
              <description>Connect Wait</description>
              <bitRange>[7:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>FSEOF</name>
          <description>USB Full-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_FSEOF_FSEOFG</name>
              <description>Full-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LSEOF</name>
          <description>USB Low-Speed Last Transaction to End of Frame Timing</description>
          <addressOffset>0x0000007E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_LSEOF_LSEOFG</name>
              <description>Low-Speed End-of-Frame Gap</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRL0</name>
          <description>USB Control and Status Endpoint 0 Low</description>
          <addressOffset>0x00000102</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRL0_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_DATAEND</name>
              <description>Data End</description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETEND</name>
              <description>Setup End</description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_STALL</name>
              <description>Send Stall</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_RXRDYC</name>
              <description>RXRDY Clear</description>
              <bitRange>[6:6]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>USB_CSRL0_SETENDC</name>
              <description>Setup End Clear</description>
              <bitRange>[7:7]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSRH0</name>
          <description>USB Control and Status Endpoint 0 High</description>
          <addressOffset>0x00000103</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>USB_CSRH0_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>COUNT0</name>
          <description>USB Receive Byte Count Endpoint 0</description>
          <addressOffset>0x00000108</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_COUNT0_COUNT</name>
              <description>FIFO Count</description>
              <bitRange>[6:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP1</name>
          <description>USB Maximum Transmit Data Endpoint 1</description>
          <addressOffset>0x00000110</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL1</name>
          <description>USB Transmit Control and Status Endpoint 1 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000112</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL1_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL1_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH1</name>
          <description>USB Transmit Control and Status Endpoint 1 High</description>
          <addressOffset>0x00000113</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH1_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH1_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP1</name>
          <description>USB Maximum Receive Data Endpoint 1</description>
          <addressOffset>0x00000114</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP1_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL1</name>
          <description>USB Receive Control and Status Endpoint 1 Low</description>
          <addressOffset>0x00000116</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL1_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL1_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH1</name>
          <description>USB Receive Control and Status Endpoint 1 High</description>
          <addressOffset>0x00000117</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH1_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH1</name>
          <description>USB Receive Control and Status Endpoint 1 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000117</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH1_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH1_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT1</name>
          <description>USB Receive Byte Count Endpoint 1</description>
          <addressOffset>0x00000118</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT1_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP2</name>
          <description>USB Maximum Transmit Data Endpoint 2</description>
          <addressOffset>0x00000120</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP2_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL2</name>
          <description>USB Transmit Control and Status Endpoint 2 Low</description>
          <addressOffset>0x00000122</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL2_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL2_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL2_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL2_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL2_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL2</name>
          <description>USB Transmit Control and Status Endpoint 2 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000122</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL2_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL2_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRH2</name>
          <description>USB Transmit Control and Status Endpoint 2 High</description>
          <addressOffset>0x00000123</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRH2_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH2_FDT</name>
              <description>Force Data Toggle</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH2_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH2_MODE</name>
              <description>Mode</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH2_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRH2_AUTOSET</name>
              <description>Auto Set</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXMAXP2</name>
          <description>USB Maximum Receive Data Endpoint 2</description>
          <addressOffset>0x00000124</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXMAXP2_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRL2</name>
          <description>USB Receive Control and Status Endpoint 2 Low</description>
          <addressOffset>0x00000126</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRL2_RXRDY</name>
              <description>Receive Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_FULL</name>
              <description>FIFO Full</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_OVER</name>
              <description>Overrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_DATAERR</name>
              <description>Data Error</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_STALL</name>
              <description>Send STALL</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRL2_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH2</name>
          <description>USB Receive Control and Status Endpoint 2 High</description>
          <addressOffset>0x00000127</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH2_DMAMOD</name>
              <description>DMA Request Mode</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH2_PIDERR</name>
              <description>PID Error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH2_DMAEN</name>
              <description>DMA Request Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH2_AUTOCL</name>
              <description>Auto Clear</description>
              <bitRange>[7:7]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCSRH2</name>
          <description>USB Receive Control and Status Endpoint 2 High</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000127</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_RXCSRH2_DISNYET</name>
              <description>Disable NYET</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>USB_RXCSRH2_ISO</name>
              <description>Isochronous Transfers</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RXCOUNT2</name>
          <description>USB Receive Byte Count Endpoint 2</description>
          <addressOffset>0x00000128</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_RXCOUNT2_COUNT</name>
              <description>Receive Packet Count</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXMAXP3</name>
          <description>USB Maximum Transmit Data Endpoint 3</description>
          <addressOffset>0x00000130</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>USB_TXMAXP3_MAXLOAD</name>
              <description>Maximum Payload</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL3</name>
          <description>USB Transmit Control and Status Endpoint 3 Low</description>
          <addressOffset>0x00000132</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL3_TXRDY</name>
              <description>Transmit Packet Ready</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL3_FIFONE</name>
              <description>FIFO Not Empty</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL3_FLUSH</name>
              <description>Flush FIFO</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL3_STALLED</name>
              <description>Endpoint Stalled</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL3_CLRDT</name>
              <description>Clear Data Toggle</description>
              <bitRange>[6:6]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCSRL3</name>
          <description>USB Transmit Control and Status Endpoint 3 Low</description>
          <alternateGroup>USB0_ALT</alternateGroup>
          <addressOffset>0x00000132</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>USB_TXCSRL3_UNDRN</name>
              <description>Underrun</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>USB_TXCSRL3_STALL</name>
              <description>Send STALL</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
